{
    "categories": {
        "0": "technical"
    },
    "demo_page": "https://bubble.io/page?name=index&id=test-converttime",
    "description": "This plugin includes two elements, ConvertTime and DurationFormatter. \n\nThe ConvertTime element converts a date in the user's local time zone (localDate) to the desired time zone (dstZone). The need for this arose for me when I wanted to enter a start date/time in another time zone from my local zone. For example, say your local date is July 10, 2020 5pm PST (browser's time zone) and you want that time to be considered in EST at 5pm. Set dstZone to the desired time zone ID such as \"America/New_York\". The resulting ConvertTime's dstDate will reflect the desired time zone as though the user were in EST. If you display dstDate, it will show July 10, 2020 2pm because the date is really at 5pm because Bubble will convert that new dstDate into your local time zone. Confused yet?\n\nThe new DurationFormatter presently formats a duration of minutes or seconds less than one day into a desired display format: CountdownHMS, CountdownHM, DurationHMS or DurationHM. If your duration is 90 minutes and 50 seconds:\n\nCountdownHMS = 01:30:50\nCountdownHM = 01:30\nDurationHMS = 1h 30m 50s\nDurationHM = 1h 30m\n\nThe plugin uses moment and moment-timezone libraries. You don't need any other elements or workflows to get the benefit you seek.\n\nIcon made by <a href=\"https://www.flaticon.com/authors/freepik\" title=\"Freepik\">Freepik</a> from <a href=\"https://www.flaticon.com/\" title=\"Flaticon\"> www.flaticon.com</a>",
    "image": "//s3.amazonaws.com/appforest_uf/f1594254921567x831394612985287600/time-zone.png",
    "license": "open_source",
    "name": "ConvertTime",
    "plugin_instructions": "1. Drop either element on the page. You must leave the element visible for it to work. Don't worry, it won't render anything.\n\n2. ConvertTime\n(a) Open the element's property inspector.\n(b) Connect the output of a date picker's value to \"localDate\" (date object). \n(c) Specify desired static time zone ID (text) in the \"dstZone\" field, or a dynamic value from a geographic Seachbox, say, using its value's time zone ID.\n(d) The plugin outputs a new date object to \"dstDate\". This is the adjusted date with the new time zone. Since Bubble adjusts that for the browser's time zone, it will show up as the local time when rendered.\n\n3. DurationFormat\n(a) You generate a format either via the element or workflow.\n\nELEMENT\n\n(b) Open the element's property inspector.\n(c) Supply duration in either minutes or seconds. Note if you have a date you can convert to minutes or seconds using Bubble's native convert filters.\n(d) Check In Minutes if duration is in minutes, or uncheck if seconds.\n(e) Select desired format.\n\nWORKFLOW\n\n(f) Open the page's workflow.\n(g) Create an action Element Actions > Format a DurationFormatter.\n(h) Fill out the fields as desired.\n(j) Create an event using Elements > A DurationFormatter Formatted Duration.\n(k) Now in a step within that event you can reference This DurationFormatter's Duration Format value for the result.\n"
}